{
    "metadata": {
        "Filename": "DE-157-4010-X12.json",
        "Owner": "X12",
        "Release": "4010",
        "ElementID": "157",
        "NameShort": "Shipment Status Code",
        "MinLen": 1,
        "MaxLen": 2,
        "Records": 175,
        "URL": "https://www.stedi.com/edi/x12-004010/element/157"
    },
    "data": {
        "2": "Returned to Carrier's Terminal - Delivery attempted by the carrier; shipment was returned to the carrier's terminal",
        "3": "Returned to Shipper - Shipment was returned to the shipper per the instructions of the consignee",
        "A": "Arrived - Shipment has arrived at the location specified",
        "A1": "Agriculture Canada Hold",
        "A2": "Agriculture Canada Released",
        "A3": "Agriculture Canada Refused Entry",
        "A4": "Agriculture Canada Conditional Release",
        "AA": "Pick-up Appointment Date and Time - The date and time of the scheduled pick-up appointment",
        "AC": "Awaiting Clearance",
        "AD": "Delivery Appointment Date and Time - The date and time of the scheduled delivery appointment",
        "AE": "Loaded on Vessel",
        "AF": "Departed Pickup Location - Shipment has been picked up",
        "AG": "Estimated Delivery - Estimated date of delivery to the consignee or receiver",
        "AH": "Attempted Delivery - Delivery of the shipment was attempted by the carrier",
        "AI": "Shipment Has Been Reconsigned - Shipment has been reconsigned per the shipper or consignee",
        "AJ": "Tendered for Delivery - Shipment has been offered for delivery to the consignee",
        "AL": "Loaded on Rail",
        "AM": "Loaded on Truck",
        "AN": "Delivered to Air Carrier - Shipment was delivered to air freight carrier",
        "AO": "Loaded on Barge",
        "AP": "Loaded on Feeder Vessel",
        "AR": "Rail Arrival at Destination Intermodal Ramp",
        "AV": "Available for Delivery - Shipment available for delivery",
        "AW": "Awaiting Export - Shipment in transit",
        "B": "Bad Order (Inoperative or Damaged) - Shipment was on a piece of equipment that failed",
        "BA": "Set Off at Agent",
        "BC": "Storage - in - Transit",
        "BD": "Recommitted Delivery Date - Delivery date and time of shipment has been revised necessitated by changes in pickup, transit, or delivery conditions not originally assumed by the carrier",
        "BE": "Estimated Time of Arrival at Scheduled Pick-up Location - The carrier's estimate of when the shipment will be picked up at the consignor's location",
        "BF": "Booking Confirmed",
        "BR": "Bill of Lading Released",
        "C": "Estimated To Depart Terminal Location",
        "C1": "Canada Customs Hold",
        "C2": "Canada Customs Inspection Scheduled",
        "CA": "Shipment Cancelled",
        "CB": "Chassis Tie",
        "CC": "Chassis Un-Tie",
        "CD": "Received at Origin",
        "CI": "Passing",
        "CO": "Cargo Received at Contractual Place of Receipt",
        "CR": "Carrier Release",
        "CS": "Container Sealed",
        "CT": "Customs Released",
        "CU": "Carrier and Customs Release",
        "CV": "Container Rehandled",
        "D": "Completed Unloading at Delivery Location - Shipment was delivered to the consignee or receiver",
        "DA": "Repair Authorization Requested",
        "DC": "Unit Cleaned",
        "DN": "Delivery Not Confirmed",
        "DP": "Unit Pre-Tripped",
        "DR": "Repair Authorization Received",
        "DS": "Damage Survey Requested",
        "DT": "Damage Survey Completed",
        "E": "Estimated to Arrive (En Route) - Shipment is estimated to arrive at the location specified",
        "EA": "Estimate Approved",
        "ED": "Early Delivery Appointment Date and/or Time",
        "EE": "Empty Equipment Dispatched - Empty equipment dispatched to pick up cargo",
        "EI": "Interchange Information Received - Interchange of intermodal equipment to another carrier",
        "EP": "Early Pickup Appointment Date and/or Time",
        "ER": "Estimate Received",
        "F": "In Flight",
        "FP": "Freight Paid",
        "FT": "Free Time Expired",
        "G": "Repaired and/or Released from Bad Order",
        "GI": "Terminal Gate Inspection",
        "GO": "General Order",
        "H": "Equipment Shopped for Heavy Repair - Shipment is delayed due to equipment failure",
        "HA": "Held - Protective Service",
        "HE": "Held-Awaiting Shipper's Export Document",
        "HF": "Held-Awaiting Recount/Weight/Description",
        "HG": "Held on Ground",
        "HH": "Held-No Booking Number",
        "HI": "Held-Title Clearance",
        "HR": "Hold Released - Equivalent to Automated Manifest System (AMS) disposition codes 1F, 74, 76, 80, 81 and 82",
        "I": "In-Gate",
        "IB": "U.S. Customs, In-bond Movement Authorized - Equivalent to Automated Manifest System (AMS) disposition codes 1D, 1J",
        "IR": "Movement Type Changed from In-bond to Not In-bond",
        "J": "Delivered to Connecting Line - Shipment has been delivered to an interline carrier",
        "K": "Arrived at Customs - Customs delay; shipment is being processed at the customs location",
        "L": "Loading - Shipment is being loaded at a carrier's terminal or facility",
        "LD": "Late Delivery Appointment Date and/or Time",
        "LP": "Late Pickup Appointment Date and/or Time",
        "MT": "Empty Committed",
        "N": "No Paperwork Received with Shipment or Equipment",
        "NC": "Confirmation of Notification - Advisement of notified party at destination has acknowledged receipt of notification",
        "ND": "Technical Charges Due",
        "NF": "Free Time to Expire",
        "NH": "No Hazardous Material Document Received",
        "NO": "Ocean Charges Paid",
        "NP": "Terminal Charges Paid",
        "NR": "Shipment Information Not Received",
        "NS": "No Seal on Load",
        "NT": "Notification",
        "NU": "Notification Refused - Notify party at destination has refused notification",
        "O": "Paperwork Received- Did Not Receive Shipment or Equipment",
        "OA": "Out-Gate",
        "OB": "Original Bill of Lading Received",
        "OF": "Off-Hire Container",
        "OH": "On Hand",
        "ON": "On-Hire Container",
        "P": "Departed Terminal Location - Shipment has left the carrier's terminal or other control point",
        "PA": "US Custom Hold, Intensive Examination",
        "PB": "US Custom Hold, Insufficient Paperwork",
        "PC": "US Custom Hold, Discrepancy in Paperwork",
        "PD": "US Custom Hold, Discrepancy in Piece Count",
        "PE": "US Custom Hold, Hold by Coast Guard",
        "PF": "US Custom Hold, Hold by F.B.I.",
        "PG": "US Custom Hold, Hold by Local Law Enforcement",
        "PH": "US Custom Hold, Hold by Court Imposed Lien",
        "PI": "US Custom Hold, Hold by Food and Drug",
        "PJ": "US Custom Hold, Hold by Fish and Wildlife",
        "PK": "US Custom Hold, Hold by Drug Enforcement",
        "PL": "US Dept. Agr, Hold for Intensive Investigation",
        "PM": "US Dept. Agr, Hold for Unregistered Producer",
        "PN": "US Dept. Agr, Hold for Restricted Commodity",
        "PO": "US Dept. Agr, Hold for Insect Infestation",
        "PP": "US Dept. Agr, Hold for Bacterial Contamination",
        "PQ": "U.S. Customs Hold at Place of Vessel Arrival - U.S. Customs has placed a hold on cargo at the place of arrival",
        "PR": "U.S. Customs Hold at In-Bond Destination - U.S. Customs has placed a hold on cargo at the in-bond destination",
        "PS": "U.S. Department of Agriculture Hold at Place of Vessel Arrival - U.S. Department of Agriculture has placed a hold on cargo at the place of arrival",
        "PT": "U.S. Department of Agriculture Hold at In-Bond Destination - U.S. Department of Agriculture has placed a hold on cargo at the in-bond destination",
        "PU": "Other U.S. Agency Hold at Place of Vessel Arrival - A government agency other than U.S. Customs or the U.S. Department of Agriculture has placed a hold on cargo at the place of arrival",
        "PV": "Other U.S. Agency Hold at In-Bond Destination - A government agency other than U.S. Customs or the U.S. Department of Agriculture has placed a hold on cargo at the in-bond destination",
        "PW": "U.S. Department of Agriculture, Hold for Fumigation - Equivalent to Automated Manifest System (AMS) disposition codes 73, 79",
        "PX": "U.S. Department of Agriculture, Hold for Inspection or Documentation Review - Equivalent to Automated Manifest System (AMS) disposition codes 72, 78",
        "R": "Received from Prior Carrier - Shipment has been received from an interline carrier",
        "RA": "Pickup Appointment Requested - Appointment for pickup has been requested",
        "RB": "Delivery Appointment Requested",
        "RC": "Reserve Container Against Booking",
        "RD": "Return Container",
        "RI": "Movement Type Changed from Not In-bond to In-bond",
        "RL": "Rail Departure from Origin Intermodal Ramp",
        "RN": "Renotification - Notify party at destination has been renotified",
        "S": "Spotted at Consignee's Location - Shipment in a trailer has been spotted at the consignee or receiver's premises",
        "SA": "Shipment Split",
        "SB": "Shipment Consolidation",
        "SC": "Seals Altered",
        "SD": "Shipment Delayed",
        "SI": "Receipt of Shipping Instructions - Shipping instructions received",
        "SN": "Shipment Not Authorized",
        "T": "At Terminal; Intra-Terminal Movement",
        "TC": "Held for Terminal Charges",
        "TM": "Intra-Terminal Movement",
        "TO": "Terminate to Owner - Equipment returned",
        "U": "Unloading - Shipment being unloaded",
        "UA": "Unit - Leased to Connecting Line",
        "UB": "Unit - Returned from Connecting Line",
        "UC": "Unit - Shopped Held at Terminal",
        "UD": "Unit - COFC/TOFC Service",
        "UE": "Unit - Pickup/Delivery Service",
        "UP": "Unable to Process Shipment",
        "UR": "Unloaded from a Rail Car",
        "UV": "Unloaded From Vessel",
        "UW": "Intermodal Unit Weighed",
        "V": "Vessel Rehandle",
        "VA": "Vessel Arrival - Vessel scheduled to arrive or has arrived",
        "VD": "Vessel Departure - Vessel scheduled to depart or has departed",
        "W": "Released by Customer",
        "WH": "Weight Too Heavy - Highway",
        "WR": "Weight Too Heavy - Rail",
        "X": "Removed from Customer Dock or Siding",
        "X1": "Arrived at Delivery Location - The carrier has arrived at the shipment delivery location",
        "X2": "Estimated Time of Arrival at Consignee Location",
        "X3": "Arrived at Pick-up Location",
        "X4": "Arrived at Terminal Location",
        "X5": "Arrived at Delivery Location Loading Dock",
        "X6": "En Route to Delivery Location",
        "X7": "En Route to Pick-up Location",
        "X8": "Arrived at Pick-up Location Loading Dock - The carrier has arrived at the loading dock at the pick-up location",
        "X9": "Delivery Appointment Secured - The date and time that the delivery appointment was made",
        "XA": "Pick-up Appointment Secured - The date and time that the pick-up appointment was made",
        "XB": "Shipment Acknowledged - Shipment has been accepted by the carrier, but awaiting pick-up and/or delivery appointment(s) before dispatching equipment for pick-up",
        "Y": "Constructively Placed",
        "Z": "Actually Placed",
        "ZZ": "Mutually Defined"
    }
}