{
    "metadata": {
        "Filename": "DE-66-4010-X12.json",
        "Owner": "X12",
        "Release": "4010",
        "ElementID": "66",
        "NameShort": "Identification Code Qualifier",
        "MinLen": 1,
        "MaxLen": 2,
        "Records": 215,
        "URL": "https://www.stedi.com/edi/x12-004010/element/66"
    },
    "data": {
        "1": "D-U-N-S Number, Dun & Bradstreet",
        "2": "Standard Carrier Alpha Code (SCAC)",
        "3": "Federal Maritime Commission (Ocean) (FMC)",
        "4": "International Air Transport Association (IATA)",
        "5": "SIRET",
        "6": "Plant Code",
        "7": "Loading Dock",
        "8": "UCC/EAN Global Product Identification Prefix - The first part of a UCC/EAN Product Identification Code within the Uniform Code Council (UCC) and International Article Number Association (EAN) numbering system; A globally unique 3 to 10 digit code for the identification of the company assigning the remainder of the ID code, such as U.P.C., EAN-13, SCC-14, EAN-14 or SSCC-18",
        "9": "D-U-N-S+4, D-U-N-S Number with Four Character Suffix",
        "10": "Department of Defense Activity Address Code (DODAAC)",
        "11": "Drug Enforcement Administration (DEA)",
        "12": "Telephone Number (Phone)",
        "13": "Federal Reserve Routing Code (FRRC)",
        "14": "UCC/EAN Location Code Prefix - The first part of a 13 digit UCC/EAN Location Code within the Uniform Code Council (UCC) and International Article Number Association (EAN) numbering system. A globally unique 3 to 10 digit code for the identification of a company",
        "15": "Standard Address Number (SAN)",
        "16": "ZIP Code",
        "17": "Automated Broker Interface (ABI) Routing Code",
        "18": "Automotive Industry Action Group (AIAG)",
        "19": "FIPS-55 (Named Populated Places)",
        "20": "Standard Point Location Code (SPLC)",
        "21": "Health Industry Number (HIN)",
        "22": "Council of Petroleum Accounting Societies code (COPAS)",
        "23": "Journal of Commerce (JOC)",
        "24": "Employer's Identification Number",
        "25": "Carrier's Customer Code",
        "26": "Petroleum Accountants Society of Canada Company Code",
        "27": "Government Bill Of Lading Office Code (GBLOC)",
        "28": "American Paper Institute",
        "29": "Grid Location and Facility Code",
        "30": "American Petroleum Institute Location Code",
        "31": "Bank Identification Code - Number assigned to a bank within a country (non-USA); also called a Bank Sort Code",
        "32": "Assigned by Property Operator",
        "33": "Commercial and Government Entity (CAGE)",
        "34": "Social Security Number",
        "35": "Electronic Mail Internal System Address Code",
        "36": "Customs House Broker License Number",
        "37": "United Nations Vendor Code",
        "38": "Country Code",
        "39": "Local Union Number",
        "40": "Electronic Mail User Code - Identifies the Electronic Mail User locally defined and maintained between trading partners",
        "41": "Telecommunications Carrier Identification Code - Identifies the Interexchange carrier for the charges being billed",
        "42": "Telecommunications Pseudo Carrier Identification Code - A code similar to the standard Carrier Identification Code which is used to identify the local exchange service providers",
        "43": "Alternate Social Security Number - The social security number attributed to the secondary taxpayer",
        "44": "Return Sequence Number - A unique 16-digit number that is assigned by the transmitter to each return within a transmission",
        "45": "Declaration Control Number - A unique 14-digit number assigned to each taxpayer's Form 8453 (Individual Income Tax Declaration for Electronic Filing) which is used to match this form to the filed return",
        "46": "Electronic Transmitter Identification Number (ETIN) - A unique number assigned to each transmitter and software developer",
        "47": "Tax Authority Identification",
        "48": "Electronic Filer Identification Number (EFIN) - A unique number assigned to each firm, organization, or individual who is authorized to electronically file tax returns",
        "49": "State Identification Number - A unique number that a state taxing authority assigns an organization, firm, or individual",
        "50": "Business License Number",
        "53": "Building",
        "54": "Warehouse",
        "55": "Post Office Box",
        "56": "Division",
        "57": "Department",
        "58": "Originating Company Number",
        "59": "Receiving Company Number",
        "61": "Holding Mortgagee Number",
        "62": "Servicing Mortgagee Number",
        "63": "Servicer-holder Mortgagee Number",
        "64": "One Call Agency",
        "71": "Integrated Postsecondary Education Data System (IPEDS) set of codes maintained by the U.S. Department of Education's National Center of Education Statistics, Washington, D.C.",
        "72": "The College Board's Admission Testing Program (ATP), administered by the Educational Testing Service (ETS), 4-digit list of postsecondary educational institutions.",
        "73": "Federal Interagency Commission on Education (FICE) number. Available from the United States Department of Education, National Center for Education Statistics.",
        "74": "American College Testing (ACT) list of postsecondary educational institutions.",
        "75": "State or Province Assigned Number",
        "76": "Local School District or Jurisdiction Number",
        "77": "National Center for Education Statistics (NCES) Common Core of Data (CCD) number for PreK - 12 institutions",
        "78": "The College Board and ACT 6 digit code list of secondary educational institutions",
        "81": "Classification of Instructional Programs (CIP) coding structure maintained by the U.S. Department of Education's National Center for Education Statistics",
        "82": "Higher Education General Information Survey (HEGIS) maintained by the U.S. Department of Education's National Center for Education Statistics",
        "90": "California Ethnic Subgroups Code Table",
        "91": "Assigned by Seller or Seller's Agent",
        "92": "Assigned by Buyer or Buyer's Agent",
        "93": "Code assigned by the organization originating the transaction set",
        "94": "Code assigned by the organization that is the ultimate destination of the transaction set",
        "95": "Assigned By Transporter",
        "96": "Assigned By Pipeline Operator",
        "97": "Receiver's Code - Derived from the entries in the Military Assistance Program Address Directory (MAPAD) or the Department of Defense Active Address Code (DoDAAC). Represents the location of the ultimate consignee",
        "98": "Purchasing Office - Purchasing Office (location and address) identified by a unique number found in Appendix N of the Defense Federal Acquisition Regulation Supplement",
        "99": "Office of Workers Compensation Programs (OWCP) Agency Code",
        "A": "U.S. Customs Carrier Identification",
        "A1": "Approver ID",
        "A2": "Military Assistance Program Address Code (MAPAC) - Contained in the Military Assistance Program Address Directory (MAPAD); represents the location of an entity",
        "A3": "Assigned by Third Party",
        "A4": "Assigned by Clearinghouse",
        "A5": "Committee for Uniform Security Identification Procedures (CUSIP) Number",
        "A6": "Financial Identification Numbering System (FINS) Number",
        "AA": "Postal Service Code",
        "AB": "US Environmental Protection Agency (EPA) Identification Number",
        "AC": "Attachment Control Number - Means of associating electronic claim with documentation forwarded by other means",
        "AD": "Blue Cross Blue Shield Association Plan Code - Unique 3-digit number assigned to independent Blue Cross or Blue Shield plans by Blue Cross/Blue Shield Association",
        "AE": "Alberta Energy Resources Conservation Board",
        "AL": "Anesthesia License Number - License number issued by Board of Anesthesiologist",
        "AP": "Alberta Petroleum Marketing Commission",
        "BC": "British Columbia Ministry of Energy Mines and Petroleum Resources",
        "BD": "Blue Cross Provider Number - Number assigned by Blue Cross Plan to a provider of services",
        "BE": "Common Language Location Identification (CLLI) - The standard address location code for a specific equipment location as used in the telephone industry",
        "BG": "Badge Number",
        "BP": "Benefit Plan",
        "BS": "Blue Shield Provider Number - Number assigned by Blue Shield Plan to a provider of services",
        "C": "Insured's Changed Unique Identification Number",
        "C1": "Insured or Subscriber",
        "C2": "Health Maintenance Organization (HMO) Provider Number",
        "C5": "Customer Identification File",
        "CA": "Statistics Canada Canadian College Student Information System Course Codes",
        "CB": "Statistics Canada Canadian College Student Information System Institution Codes",
        "CC": "Statistics Canada University Student Information System Curriculum Codes",
        "CD": "Contract Division",
        "CE": "Bureau of the Census Filer Identification Code",
        "CF": "Canadian Financial Institution Routing Number",
        "CI": "CHAMPUS (Civilian Health and Medical Program of the Uniformed Services) Identification Number - Number issued by CHAMPUS organization to a unique provider of services",
        "CL": "Corrected Loan Number - A new or corrected number used to identify a loan",
        "CM": "U.S. Customs Service (USCS) Manufacturer Identifier (MID) - An identification code for a manufacturer which is constructed according to U.S. Customs Service Directive 3500-13",
        "CP": "Canadian Petroleum Association",
        "CR": "Credit Repository",
        "CS": "Statistics Canada University Student Information System University Codes",
        "CT": "Court Identification Code",
        "D": "Census Schedule D",
        "DG": "United States Department of Education Guarantor Identification Code",
        "DL": "United States Department of Education Lender Identification Code",
        "DN": "Dentist License Number - License number issued by American Dental Association",
        "DP": "Data Processing Point",
        "DS": "United States Department of Education School Identification Code",
        "E": "Hazard Insurance Policy Number",
        "EC": "ARI Electronic Commerce Location ID Code",
        "EH": "Theatre Number - Number assigned by the exhibition company",
        "EI": "Employee Identification Number",
        "EP": "U.S. Environmental Protection Agency (EPA)",
        "EQ": "Insurance Company Assigned Identification Number",
        "ER": "Mortgagee Assigned Identification Number",
        "ES": "Automated Export System (AES) Filer Identification Code",
        "F": "Document Custodian Identification Number",
        "FA": "Facility Identification",
        "FB": "Field Code - A code assigned by regulatory agencies to a surface area",
        "FC": "Federal Court Jurisdiction Identifier",
        "FD": "Federal Court Divisional Office Number",
        "FI": "Federal Taxpayer's Identification Number",
        "FJ": "Federal Jurisdiction",
        "FN": "U.S. Environmental Protection Agency (EPA) Laboratory Certification Identification",
        "G": "Payee Identification Number",
        "GA": "Primary Agent Identification",
        "GC": "GAS*CODE",
        "HC": "Health Care Financing Administration",
        "HN": "Health Insurance Claim (HIC) Number - Unique number assigned to individual for submitting claims covered by Medicare benefits",
        "I": "Secondary Marketing Investor Assigned Number",
        "J": "Mortgage Electronic Registration System Organization Identifier",
        "K": "Census Schedule K",
        "L": "Investor Assigned Identification Number",
        "LC": "Agency Location Code (U.S. Government)",
        "LD": "NISO Z39.53 Language Codes",
        "LE": "ISO 639 Language Codes",
        "LI": "Labeler Identification Code (LIC)",
        "LN": "Loan Number - A unique number used to identify a loan on a property, entity, or location at a financial institution or mortgage broker",
        "M3": "Disbursing Station - DOD Disbursing Offices (location and address) can be identified by a unique number found in departmental regulations",
        "M4": "Department of Defense Routing Identifier Code (RIC) - An integral and predetermined participant in an established logistical system performing general logistic control, distribution, and storage functions",
        "M5": "Jurisdiction Code",
        "M6": "Division Office Code",
        "MA": "Mail Stop",
        "MB": "Medical Information Bureau",
        "MC": "Medicaid Provider Number - Number assigned to a health care provider for submitting claims covered by Medicaid benefits",
        "MD": "Manitoba Department of Mines and Resources",
        "MI": "Member Identification Number",
        "MK": "Market",
        "ML": "Multiple Listing Service Vendor - Multiple Listing Service Identification",
        "MN": "Mortgage Identification Number",
        "MP": "Medicare Provider Number - Number assigned to a health care provider for submitting claims covered by Medicare benefits",
        "MR": "Medicaid Recipient Identification Number - Unique identification number assigned to each member covered under a subscriber's contract",
        "N": "Insured's Unique Identification Number",
        "NA": "National Association of Realtors - Multiple Listing Service Identification",
        "ND": "Mode Designator",
        "NI": "National Association of Insurance Commissioners (NAIC) Identification",
        "NO": "National Criminal Information Center Originating Agency",
        "OC": "Occupation Code - Identifies individual's occupation",
        "OP": "On-line Payment and Collection",
        "PA": "Secondary Agent Identification",
        "PB": "Public Identification",
        "PC": "Provider Commercial Number - Unique number assigned to the provider for submitting claims to commercial insurance carriers",
        "PI": "Payor Identification",
        "PP": "Pharmacy Processor Number - Unique number assigned to each pharmacy for submitting claims",
        "PR": "Pier",
        "RA": "Regulatory Agency Number - A number assigned to a regulatory jurisdiction",
        "RB": "Real Estate Agent",
        "RC": "Real Estate Company",
        "RD": "Real Estate Broker Identification",
        "RE": "Real Estate License Number",
        "RT": "Railroad Track",
        "S": "Title Insurance Policy Number",
        "SA": "Tertiary Agent Identification",
        "SB": "Social Insurance Number",
        "SD": "Saskatchewan Department of Energy Mines and Resources",
        "SF": "Suffix Code - A code assigned by a regulatory agency to operator numbers",
        "SI": "Standard Industry Code (SIC)",
        "SJ": "State Jurisdiction",
        "SL": "State License Number - Number uniquely issued to provider by state licensing board",
        "SP": "Specialty License Number - License number issued to identify providers unique area of practice",
        "ST": "State/Province License Tag",
        "SV": "Service Provider Number",
        "SW": "Society for Worldwide Interbank Financial Telecommunications (SWIFT) Address",
        "TA": "Taxpayer ID Number",
        "TC": "Internal Revenue Service Terminal Code",
        "TZ": "Department Code",
        "UC": "Consumer Credit Identification Number",
        "UL": "UCC/EAN Location Code - A globally unique 13 digit code for the identification of a legal, functional or physical location within the Uniform Code Council (UCC) and International Article Number Association (EAN) numbering system",
        "UM": "UCC/EAN Location Code Suffix - The last part of a 13 digit UCC/EAN Location Code within the Uniform Code Council (UCC) and International Number Association (EAN) numbering system; A 3 to 10 digit code for the identification of a location within the company identified by the UCC/EAN Location Code Prefix",
        "UP": "Unique Physician Identification Number (UPIN) - Number assigned to the provider by the National Registry for Medicare identification purposes",
        "UR": "Uniform Resource Locator (URL)",
        "US": "Unique Supplier Identification Number (USIN)",
        "WR": "Wine Region Code",
        "XV": "Health Care Financing Administration National Payer Identification Number (PAYERID)",
        "XX": "Health Care Financing Administration National Provider Identifier",
        "ZC": "Contractor Establishment Code",
        "ZN": "Zone",
        "ZY": "Temporary Identification Number - A temporary ID to be used until a permanent ID is processed",
        "ZZ": "Mutually Defined"
    }
}